{
  "translation": {
    "oppositeLanguage": "pt",
    "navMain": "Home",
    "navAbout": "About Me",
    "navProjects": "Projects",
    "navExperience": "Experience",
    "navRole": "Game and Web Developer",
    "heroRole": "Game and Web Developer",
    "heroButtonDownload": "Download Resume",
    "heroButtonContact": "Contact Me",
    "downloadLinkName": "LucasQueirolo_Resume.pdf",
    "aboutTitle": "About Me",
    "aboutText": "My name is Lucas Queirolo dos Santos. I started my career in game development and later expanded into web development. I have experience mainly with the Unity/C# and Godot/GDScript engines, as well as knowledge in various areas of game design. As a web developer, I have a solid foundation in HTML, CSS, and JavaScript, and I currently create projects using React/TypeScript.",
    "aboutEducation": "Education",
    "aboutUniversity": "Digital Games — IBMR",
    "aboutEducation2": "Postgraduate",
    "aboutUniversity2": "Software Engineering — PUC-RJ",
    "present": "Currently",
    "skillsTitle": "Skills",
    "projectsTitle": "Projects",
    "projectsButtonViewProject": "View Project",
    "projectsButtonViewCode": "Github",
    "project1Title": "This Portfolio",
    "project1Text": "Project created to put my front-end development skills into practice and showcase my abilities and experience.",
    "project2Title": "Growers",
    "project2Text": "A game developed by the O Pão Game Studio team, where I worked as a game designer, programmer, and project manager. It received investment proposals and took me to Japan, to the Tokyo Game Show 2023, to showcase it. It is also available for sale on Steam!",
    "project3Title": "Other Games",
    "project3Text": "This is my Itch.io page, where you can find most of the games I have developed over the years. In each of them, I acted as a manager, game designer, and programmer.",
    "project4Title": "Volin",
    "project4Text": "A game developed in Unity Engine as a personal project with some colleagues. It is not yet finished, but it already delivers a good experience. I contributed to some game design decisions, but my main role was as a programmer.",
    "project5Title": "BMG Bot",
    "project5Text": "Automation project developed for Banco BMG. The bot navigates a website, using spreadsheets to fill in and verify data, updating the necessary information in each spreadsheet and generating a log for each iteration.",
    "project6Title": "Franco Gagnor Store",
    "project6Text": "Website developed with a colleague for Franco Gagnor, an aquarium store, based on a Figma design requested by the client. It is not yet finished.",
    "experienceTitle": "Experience",
    "experience1Title": "O Pão Game Studio",
    "experience1Text": "I worked as a game designer and programmer at O Pão Game Studio, an indie game studio based in Rio de Janeiro. With a small team, I took on multiple tasks and was primarily responsible for project management. I participated in the development of GDDs, level design, game balancing, and optimization, as well as programming using the Unity and Godot engines. The main project I worked on at the studio was the game Growers, which received investment proposals through the Indie Hero program, was showcased in Japan at the Tokyo Game Show, and is currently available for sale on Itch.io and Steam. It was a great opportunity to be involved in the entire game development and publishing process.",
    "experience2Title": "Legends of Learning",
    "experience2Text": "I worked as a freelancer for Legends of Learning, a U.S.-based educational platform that provides science and math games for children and teenagers. I worked as a game designer and programmer, developing game ideas that conveyed the required topics for each subject, writing GDDs according to the company's requirements, managing a small team to ensure final delivery within the deadline, and developing with C# in Unity and GDScript in Godot Engine. It was an excellent opportunity to improve my skills in these engines, increasing efficiency in production, and continue developing management skills.",
    "experience3Title": "Octopus Game Studio",
    "experience3Text": "I was an assistant manager at Octopus Game Studio, an indie game studio in Rio de Janeiro. I was responsible for assisting in business decision-making, managing and supervising the team by relaying management requests, organizing events and classes offered by the studio, and assisting in budget management. In this role, I had the opportunity to refine my project and people management skills, as well as improve my communication and leadership abilities.",
    "footerContact": "Contact",
    "footerRights": "© 2025 Lucas Queirolo. All rights reserved.",
    "messageGreeting": "Hello,",
    "steamPage": "Steam",
    "itchPage": "Itch.io"
  }
}