{
  "translation": {
    "oppositeLanguage": "en",
    "navMain": "Inicio",
    "navAbout": "Sobre mim",
    "navProjects": "Projetos",
    "navExperience": "Experiência",
    "navRole": "Desenvolvedor Web e de Jogos",
    "heroRole": "Desenvolvedor Web e de Jogos",
    "heroButtonDownload": "Baixar Currículo",
    "heroButtonContact": "Entre em contato",
    "donwloadLinkName": "LucasQueirolo_Currículo.pdf",
    "aboutTitle": "Sobre mim",
    "aboutText": "Eu me chamo Lucas Queirolo dos Santos, iniciei minha carreira no desenvolvimento de jogos e expandi minha atuação para o desenvolvimento web. Tenho experiência principalmente com as engines Unity/C# e Godot/GDScript, além de conhecimentos em diversas áreas de game design. Como desenvolvedor web, possuo uma base sólida em HTML, CSS e Javascript e atualmente crio projetos utilizando React/Typescript.",
    "aboutEducation": "Formação",
    "aboutUniversity": "Jogos Digitais — IBMR",
    "skillsTitle": "Habilidades",
    "projectsTitle": "Projetos",
    "projectsButtonViewProject": "Ver Projeto",
    "projectsButtonViewCode": "Github",
    "project1Title": "Este Portfólio",
    "project1Text": "Projeto feito para por em prática meus conhecimentos em desenolvimento front-end e expor minhas habilidades e experiências.",
    "project2Title": "Growers",
    "project2Text": "Jogo desenvolvido pela equipe do Pão Game Studio, no qual atuei como game designer, programador e gestor do projeto. Recebeu propostas de investimento e me levou ao Japão, na Tokyo Game Show de 2023, para o expor. Também está à venda na Steam!",
    "project3Title": "Outros Jogos",
    "project3Text": "Essa é minha página na Itch.io, onde você pode encontrar grande parte dos jogos que produzi ao longo dos anos. Em cada um deles atuei como gestor, game designer e programador.",
    "project4Title": "Volin",
    "project4Text": "Jogo desenvolvido na Unity Engine como um projeto pesssoal junto à alguns colegas. Ainda não foi finalizado, mas já consegue entregar uma boa experiência. Tomei algumas decisões de game design, mas atuei principalmente como programador.",
    "project5Title": "BMG Bot",
    "project5Text": "Projeto de automação feito para o banco BMG. O bot navega por um site, utilizando planilhas para preencher e checar dados, atualizando as informações necessárias em cada planilha e gerando um log para cada iteração.",
    "experienceTitle": "Experiência",
    "experience1Title": "O Pão Game Studio",
    "experience1Text": "Trabalhei como game desinger e programador para O Pão Game Studio, um estúdio indie de jogos do Rio de janeiro. Contando com uma equipe pequena, atuei em múltiplas tarefas e fui o principal responsável pela gestão dos projetos. Participei do desenvolvimento de GDD's, criação de níveis, balanceamento e otimização dos jogos, além de atuar como programador, utilizando as engines Unity e Godot. O principal projeto em que trabalhei no estúdio foi o jogo Growers, que recebeu propostas de investimento através do programa Indie Hero, foi exposto no Japão durante a Tokyo Game Show e se encontra atualmente à venda nas plataformas Itch.io e Steam. Foi uma ótima oportunidade para participar de todo o processo de desenvolvimento e publicação de um jogo.",
    "experience2Title": "Legends of Learning",
    "experience2Text": "Trabalhei como freelancer para a Legends of Learning, uma plataforma de aprendizado americana que disponibiliza jogos educativos de ciências e matemática para crianças e adolescentes. Atuei como game designer e programador, desenvolvendo ideias de jogos que transmitissem os tópicos pedidos em cada matéria, elaborando GDD's de acordo com os requisitos da empresa, gerenciando uma pequena equipe para assegurar a entrega final dentro do prazo, e desenvolvendo com C# na Unity e GDScript na Godot Engine. Foi uma excelente oportunidade para evoluir dentro das engines, aumentando a eficiência na produção, bem como para continuar a desenvolver habilidades de gestão.",
    "experience3Title": "Octopus Game Studio",
    "experience3Text": "Atuei como sub-gerente na Octopus Game Studio, um estúdio indie de jogos do Rio de Janeiro. Fui reponsável por auxiliar na tomada de decisões empresariais, gerenciar e supervisionar a equipe passando requisições da gerência, fazer a organização de eventos e aulas disponibilizadas pelo estúdio, além de auxiliar na gestão do orçamento. Nesse papel, tive a oportunidade de aprimorar minhas habilidades de gestão de projetos e pessoas, bem como trabalhar minha comunicação e liderança.",
    "footerContact": "Contato",
    "footerRights": "© 2025 Lucas Queirolo. Todos os direitos reservados.",
    "messageGreeting": "Olá,",
    "steamPage": "Steam",
    "itchPage": "Itch.io"
  }
}